In [1]:
import pandas as pd
import numpy as np

In [2]:
#groupby

In [3]:
maasSozlugu = {"Departman":["Yazılım","Satış","Pazarlama","Finans","İnsan Kaynakları","Hukuk"],
               "Çalışan İsmi":["Ahmet","Mehmet","Deniz","Burak","Zeynep","Fatma"],
               "Maas":[100,150,200,300,400,500]
               }

In [4]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [5]:
maasSozlugu

{'Departman': ['Yazılım',
  'Satış',
  'Pazarlama',
  'Finans',
  'İnsan Kaynakları',
  'Hukuk'],
 'Çalışan İsmi': ['Ahmet', 'Mehmet', 'Deniz', 'Burak', 'Zeynep', 'Fatma'],
 'Maas': [100, 150, 200, 300, 400, 500]}

In [6]:
maasDataFrame

          Departman Çalışan İsmi  Maas
0           Yazılım        Ahmet   100
1             Satış       Mehmet   150
2         Pazarlama        Deniz   200
3            Finans        Burak   300
4  İnsan Kaynakları       Zeynep   400
5             Hukuk        Fatma   500

In [7]:
maasSozlugu = {"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
               "Çalışan İsmi":["Ahmet","Mehmet","Deniz","Burak","Zeynep","Fatma"],
               "Maas":[100,150,200,300,400,500]
               }

In [8]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [9]:
maasDataFrame

   Departman Çalışan İsmi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama        Deniz   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [12]:
grup_obje = maasDataFrame.groupby("Departman")

In [13]:
grup_obje

In [14]:
grup_obje.count()

           Çalışan İsmi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [15]:
grup_obje.min()

          Çalışan İsmi  Maas
Departman
Hukuk            Fatma   400
Pazarlama        Burak   200
Yazılım          Ahmet   100

In [16]:
grup_obje.max()

          Çalışan İsmi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Deniz   300
Yazılım         Mehmet   150

In [17]:
grup_obje.all()

           Çalışan İsmi  Maas
Departman
Hukuk              True  True
Pazarlama          True  True
Yazılım            True  True

In [18]:
grup_obje.corr()

                Maas
Departman
Hukuk     Maas   1.0
Pazarlama Maas   1.0
Yazılım   Maas   1.0

In [19]:
grup_obje.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0